/********************************************************************************************************
*	模块名称 : 主程序入口
*	文件名称 : main.c
*	版    本 : V1.0
*	说    明 : 串口通信例子，和PC机超级终端软件进行交互
*	修改记录 :
********************************************************************************************************/
#include "main.h"

// 定义例程名和例程发布日期
#define DEMO_NAME	"糖浆模块"
#define DEMO_VER	"1.0"

/********************************************************************************************************
*	函 数 名: main
*	功能说明: c程序入口
*	形    参：无
*	返 回 值: 错误代码(无需处理)
********************************************************************************************************/
int main(void)
{
	bsp_Init();		//硬件初始化	
	initPara();
	
	//主循环
	while (1)
	{		
		if (comCheckEnd(COM1)>0)
		{
			if ( !cmdStringRece() ) 
			{
				cmdStringProcess();
			}
		}
		bsp_Idle();		// CPU空闲时执行的函数，在 bsp.c
	}
}


/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
